-- MySQL dump 10.13  Distrib 5.7.12, for Win64 (x86_64)
--
-- Host: localhost    Database: test
-- ------------------------------------------------------
-- Server version	5.7.17-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `book_tags`
--

DROP TABLE IF EXISTS `book_tags`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `book_tags` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `category` varchar(10) NOT NULL,
  `parent_id` int(11) NOT NULL DEFAULT '0',
  `child_count` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `category_UNIQUE` (`category`)
) ENGINE=InnoDB AUTO_INCREMENT=187 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book_tags`
--

LOCK TABLES `book_tags` WRITE;
/*!40000 ALTER TABLE `book_tags` DISABLE KEYS */;
INSERT INTO `book_tags` VALUES (40,'经管',0,9),(41,'广告',40,25),(42,'投资',40,42),(43,'管理',40,59),(44,'营销',40,37),(45,'企业史',40,20),(46,'经济学',40,41),(47,'金融',40,43),(48,'经济',40,64),(49,'理财',40,23),(50,'策划',40,19),(51,'创业',40,22),(52,'股票',40,25),(53,'商业',40,69),(54,'文学',0,57),(55,'外国名著',54,8),(56,'王小波',54,19),(57,'诗歌',54,5),(58,'经典',54,65),(59,'日本文学',54,14),(60,'诗词',54,5),(61,'散文',54,23),(62,'杂文',54,18),(63,'村上春树',54,1),(64,'儿童文学',54,24),(65,'小说',54,96),(66,'童话',54,24),(67,'钱钟书',54,3),(68,'余华',54,2),(69,'米兰·昆德拉',54,0),(70,'名著',54,17),(71,'当代文学',54,2),(72,'港台',54,0),(73,'张爱玲',54,0),(74,'杜拉斯',54,0),(75,'中国文学',54,42),(76,'古典文学',54,16),(77,'外国文学',54,69),(78,'茨威格',54,0),(79,'随笔',54,42),(80,'鲁迅',54,1),(81,'流行',0,0),(82,'青春',81,3),(83,'科幻小说',81,0),(84,'张悦然',81,0),(85,'科幻',81,2),(86,'青春文学',81,1),(87,'阿加莎·克里斯蒂',81,0),(88,'东野圭吾',81,0),(89,'沧月',81,0),(90,'推理',81,1),(91,'言情',81,2),(92,'金庸',81,0),(93,'张小娴',81,0),(94,'几米',81,0),(95,'高木直子',81,0),(96,'绘本',81,16),(97,'韩寒',81,0),(98,'安妮宝贝',81,0),(99,'奇幻',81,2),(100,'校园',81,0),(101,'耽美',81,0),(102,'J.K.罗琳',81,0),(103,'郭敬明',81,0),(104,'穿越',81,0),(105,'亦舒',81,2),(106,'轻小说',81,1),(107,'悬疑',81,1),(108,'推理小说',81,0),(109,'落落',81,0),(110,'魔幻',81,0),(111,'日本漫画',81,1),(112,'武侠',81,0),(113,'网络小说',81,0),(114,'三毛',81,1),(115,'漫画',81,8),(116,'幾米',81,0),(117,'古龙',81,0),(118,'科技',0,15),(119,'交互设计',118,43),(120,'交互',118,15),(121,'神经网络',118,16),(122,'程序',118,1),(123,'UE',118,12),(124,'算法',118,22),(125,'科普',118,82),(126,'用户体验',118,41),(127,'web',118,25),(128,'通信',118,16),(129,'UCD',118,13),(130,'互联网',118,66),(131,'编程',118,52),(132,'科学',118,29),(133,'文化',0,38),(134,'政治学',133,3),(135,'国学',133,7),(136,'人文',133,6),(137,'二战',133,2),(138,'中国历史',133,0),(139,'西方哲学',133,0),(140,'考古',133,0),(141,'政治',133,5),(142,'社会',133,11),(143,'电影',133,3),(144,'佛教',133,3),(145,'心理学',133,98),(146,'传记',133,28),(147,'军事',133,0),(148,'社会学',133,37),(149,'建筑',133,5),(150,'艺术',133,22),(151,'近代史',133,0),(152,'历史',133,38),(153,'宗教',133,4),(154,'艺术史',133,0),(155,'绘画',133,1),(156,'美术',133,0),(157,'音乐',133,0),(158,'设计',133,76),(159,'戏剧',133,3),(160,'数学',133,13),(161,'思想',133,8),(162,'自由主义',133,2),(163,'哲学',133,29),(164,'人物传记',133,4),(165,'回忆录',133,2),(166,'生活',0,79),(167,'摄影',166,21),(168,'职场',166,28),(169,'美食',166,21),(170,'成长',166,30),(171,'家居',166,20),(172,'两性',166,19),(173,'旅行',166,40),(174,'自助游',166,19),(175,'励志',166,27),(176,'养生',166,21),(177,'心理',166,58),(178,'灵修',166,22),(179,'人际关系',166,9),(180,'教育',166,21),(181,'游记',166,26),(182,'情感',166,18),(183,'手工',166,20),(184,'健康',166,41),(185,'爱情',166,30),(186,'女性',166,29);
/*!40000 ALTER TABLE `book_tags` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-06-18 19:26:54
